УТ_для_edt/src/DataProcessors/CRM_МастерРегистрацииОбращения/CRM_МастерРегистрацииОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МастерРегистрацииОбращения</name>
</mdclass:DataProcessor>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_МастерРегистрацииОбращения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеСценарииПродаж(Знач ПараметрыСценариев) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДоступныеСценарии = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеПоТипуОбращенияСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|ГДЕ
	|	СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЭтоПоддержка
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕ СостоянияИнтересов.ЭтоПоддержка
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияИнтересовТипыОбращений.Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов.ТипыОбращений КАК СостоянияИнтересовТипыОбращений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ПО (СостоянияИнтересов.Ссылка = СостоянияИнтересовТипыОбращений.Ссылка)
	|ГДЕ
	|	СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЭтоПоддержка
	|				ТОГДА СостоянияИнтересов.ЭтоПоддержка
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И СостоянияИнтересовТипыОбращений.ТипОбращения = &ТипОбращения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеПоПодразделениямСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.Подразделения КАК ПодразделенияСостояний
	|		ПО СостоянияИнтересов.Ссылка = ПодразделенияСостояний.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ПодразделенияСостояний.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	И СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка
	|			ИЗ
	|				ДоступныеПоТипуОбращенияСостояния КАК Т)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.Подразделения КАК ПодразделенияСостояний
	|		ПО СостоянияИнтересов.Ссылка = ПодразделенияСостояний.Ссылка
	|ГДЕ
	|	ПодразделенияСостояний.Подразделение В ИЕРАРХИИ(&Подразделение)
	|	И СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ СостоянияИнтересов.ПометкаУдаления
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка
	|			ИЗ
	|				ДоступныеПоТипуОбращенияСостояния КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.ТипыУслуг КАК ТипыУслугСостояний
	|		ПО СостоянияИнтересов.Ссылка = ТипыУслугСостояний.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ТипыУслугСостояний.Ссылка, ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка)
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				ДоступныеПоПодразделениямСостояния.Ссылка КАК Ссылка
	|			ИЗ
	|				ДоступныеПоПодразделениямСостояния)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияИнтересов.Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК СостоянияИнтересов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.ТипыУслуг КАК ТипыУслугСостояний
	|		ПО СостоянияИнтересов.Ссылка = ТипыУслугСостояний.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьТипыУслуг
	|				ТОГДА ТипыУслугСостояний.ТипУслуги = &ТипУслуги
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СостоянияИнтересов.Ссылка В
	|			(ВЫБРАТЬ
	|				ДоступныеПоПодразделениямСостояния.Ссылка КАК Ссылка
	|			ИЗ
	|				ДоступныеПоПодразделениямСостояния)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоступныеСостояния.Ссылка КАК Ссылка
	|ИЗ
	|	ДоступныеСостояния КАК ДоступныеСостояния";
	
	Запрос.УстановитьПараметр("ТипУслуги", ПараметрыСценариев.ТипУслуги);
	Запрос.УстановитьПараметр("ИспользоватьТипыУслуг", ПараметрыСценариев.ИспользоватьТипыУслуг);
	Если ПараметрыСценариев.Свойство("Подразделение") Тогда
		Запрос.УстановитьПараметр("Подразделение", ПараметрыСценариев.Подразделение);
	ИначеЕсли ПараметрыСценариев.Свойство("Ответственный") Тогда
		Запрос.УстановитьПараметр("Подразделение", CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(ПараметрыСценариев.Ответственный, "Подразделение"));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипОбращения", ПараметрыСценариев.ТипОбращения);
	Запрос.УстановитьПараметр("ЭтоПоддержка", ПараметрыСценариев.ЭтоПоддержка);
	
	ДоступныеСценарии.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Если Не ПараметрыСценариев.ЭтоПоддержка И ПараметрыСценариев.ДоступныКарты Тогда
		
		ПроцессыИКарты = CRM_БизнесПроцессыСервер.ВернутьСпискиДоступныхПроцессовИКарт(Истина);
		
		Для Каждого ЭлементСписка Из ПроцессыИКарты.Карты Цикл
			ДоступныеСценарии.Добавить(ЭлементСписка.Значение, Строка(ЭлементСписка.Значение),,БиблиотекаКартинок.CRM_ПодсистемаБизнесПроцессы_Такси);
			Для Каждого ЭлементСпискаПроцесс Из ПроцессыИКарты.Процессы Цикл
				Если ЭлементСпискаПроцесс.Значение.CRM_КартаМаршрута = ЭлементСписка.Значение Тогда
					ДоступныеСценарии.Добавить(ЭлементСпискаПроцесс.Значение, "   "+Строка(ЭлементСпискаПроцесс.Значение),,БиблиотекаКартинок.Справочник);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ЭлементСписка Из ПроцессыИКарты.Процессы Цикл
			Если ДоступныеСценарии.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
				ДоступныеСценарии.Добавить(ЭлементСписка.Значение, Строка(ЭлементСписка.Значение),,БиблиотекаКартинок.Справочник);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДоступныеСценарии;
	
КонецФункции

Функция НастройкаСоставаРеквизитовПоУмолчанию() Экспорт
	
	Настройки = Новый Структура;
	ОбщиеНастройки = Новый Структура;
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("ОжидаемаяВыручка", НСтр("ru = 'Ожидаемая выручка'"), Истина);
	НастраиваемыеРеквизиты.Добавить("ОжидаемаяДатаПродажи", НСтр("ru = 'Ожидаемая дата продажи'"), Истина);
	НастраиваемыеРеквизиты.Добавить("Проект");
	НастраиваемыеРеквизиты.Добавить("ОсновнаяОрганизация", НСтр("ru = 'Организация'"));
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		НастраиваемыеРеквизиты.Добавить("Договор");
	Иначе
		НастраиваемыеРеквизиты.Добавить("Соглашение");
		НастраиваемыеРеквизиты.Добавить("Контрагент");
		НастраиваемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	НастраиваемыеРеквизиты.Добавить("РольВИнтересе", НСтр("ru = 'Роль контакта'"));
	ОбщиеНастройки.Вставить("Интерес", НастраиваемыеРеквизиты);
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектНаименованиеПолное", НСтр("ru = 'Публичное наименование'"));
	НастраиваемыеРеквизиты.Добавить("ГруппаКлиентИНН", НСтр("ru = 'ИНН'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_КодПоОКПО", НСтр("ru = 'ОКПО'"));
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_ГоловнаяОрганизация", НСтр("ru = 'Головная организация'"));
	КонецЕсли;
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектРодитель",
		?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(), НСтр("ru = 'Группа'"), НСтр("ru = 'Головное предприятие'")));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_ОсновнаяОтрасль", НСтр("ru = 'Отрасль'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_СегментРынка", НСтр("ru = 'Сегмент рынка'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_Важность", НСтр("ru = 'Важность'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектCRM_СтатусРаботы", НСтр("ru = 'Статус работы'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектОсновнойМенеджер", НСтр("ru = 'Ответственный'"));
	НастраиваемыеРеквизиты.Добавить("ГруппаТипыОтношений", НСтр("ru = 'Тип отношений'"), Истина);
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектБизнесРегион", НСтр("ru = 'Бизнес-регион'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_Адрес", НСтр("ru = 'Адрес'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ЮрАдрес", НСтр("ru = 'Юридический адрес'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектПол", НСтр("ru = 'Пол'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектДатаРождения", НСтр("ru = 'Дата рождения'"));
	НастраиваемыеРеквизиты.Добавить("Клиент_ОбъектКомментарий", НСтр("ru = 'Комментарий'"));
	ОбщиеНастройки.Вставить("Клиент", НастраиваемыеРеквизиты);
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("Должность",, Истина);
	НастраиваемыеРеквизиты.Добавить("СтатусКЛ", НСтр("ru = 'Статус'"));
	НастраиваемыеРеквизиты.Добавить("РольКонтактногоЛица", НСтр("ru = 'Роль'"));
	НастраиваемыеРеквизиты.Добавить("ПолКонтактногоЛица", НСтр("ru = 'Пол'"));
	НастраиваемыеРеквизиты.Добавить("ДатаРожденияКЛ", НСтр("ru = 'Дата рождения'"));
	НастраиваемыеРеквизиты.Добавить("Контакт_Описание", НСтр("ru = 'Описание'"));
	ОбщиеНастройки.Вставить("Контакт", НастраиваемыеРеквизиты);
	
	НастраиваемыеРеквизиты = Новый СписокЗначений;
	НастраиваемыеРеквизиты.Добавить("Должность1", НСтр("ru = 'Должность'"));
	НастраиваемыеРеквизиты.Добавить("Отрасль");
	НастраиваемыеРеквизиты.Добавить("БизнесРегион", НСтр("ru = 'Бизнес регион'"));
	НастраиваемыеРеквизиты.Добавить("РодительПК", НСтр("ru = 'Группа'"));
	ОбщиеНастройки.Вставить("ПотенциальныйКлиент", НастраиваемыеРеквизиты);
	
	Настройки.Вставить("ОбщиеНастройки", ОбщиеНастройки);
	
	Возврат Настройки;
	
КонецФункции

Функция СответствиеЭлементовМастераИИнтереса() Экспорт
	
	Соответствие = Новый Структура;
	
	Соответствие.Вставить("Должность", "Контакт_ОбъектCRM_Должность");
	Соответствие.Вставить("СтатусКЛ", "Контакт_Статус");
	Соответствие.Вставить("РольКонтактногоЛица", "Контакт_ОбъектCRM_РольКонтактногоЛица");
	Соответствие.Вставить("ПолКонтактногоЛица", "Контакт_ОбъектПол");
	Соответствие.Вставить("ДатаРожденияКЛ", "Контакт_ОбъектДатаРождения");
	Соответствие.Вставить("Контакт_Описание", "Контакт_ОбъектКомментарий");
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли
